<template>
  <b-container class="my-5">
    <b-row>
      <b-col cols="12">
        <p class="b">เกี่ยวกับเรา</p>
        <hr class="my-4" />

        <p class="p">เว็บไซต์เราให้บริการอะไร?</p>
        <p claSS="q">
          เว็บไซต์เราเป็นเว็บไซต์ที่ให้บริการผู้ใช้ในการตรวจความเสี่ยงการเป็นโรคเบาหวานและโรคหัวใจเพื่อที่ว่าผู้ใช้ที่มีความเสี่ยงในการเป็นโรคเบาหวานหรือโรคหัวใจสูงจะได้เข้ารับการรักษาที่โรงพยาบาลได้อย่างทันท่วงที
        </p>

        <p class="p">ที่มาของเว็บไซต์เรา</p>
        <p class="q" style="text-indent: 70px">
          ในปัจจุบัน
          คนไทยมีอัตราการเป็นโรคเบาหวานและโรคหัวใจเพิ่มขึ้นอย่างต่อเนื่อง
          จากการเปลี่ยนแปลงในการดำเนินชีวิตในในปัจจุบัน ทั้งด้านการเดินทาง
          การทำงาน การทานอาหาร
          ทำให้เห็นว่าทั้งโรคเบาหวานและโรคหัวใจเป็นภัยอันตรายที่อยู่ใกล้ตัวของเรา
          ซึ่งการเป็นโรคเบาหวานนั้นมีสาเหตุหลักมาจาก กรรมพันธุ์
          พฤติกรรมการรับประทานอาหาร และการที่ตับอ่อนไม่สามารถผลิตอินซูลินได้
          ในขณะที่โรคหัวใจนั้นมีหลายชนิด
          แต่ส่วนมากจะพบปัญหาบ่อยกับไขมันในหลอดเลือดใกล้หัวใจ
          ซึ่งเกิดจากการรับประทานอาหารในปัจจุบันที่เน้นของที่มีคอเลสเตอรอลสูงและไม่มีประโยชน์
          และสำหรับผู้ที่่ป่วยเป็นโรคเบาหวานมีโอกาสเสี่ยงที่จะเป็นโรคหัวใจจากการผิดปกติของหลอดเลือดมากกว่าคนทั่วไป
          โดยผู้ป่วยโรคเบาหวานจะมีโอกาสเสียชีวิตจากโรคหัวใจมากกว่าคนปกติ
          เนื่องจากผู้ป่วยโรคเบาหวานจะมีโอกาสเป็นโรคหลอดเลือดตีบได้ในอายุที่น้อยกว่าทำให้หลอดเลือดเกิดการเสื่อมสภาพเป็นเวลานาน
          ซึ่งการตรวจสุขภาพของคนส่วนใหญ่ที่ทำกันก็คือการตรวจสุขภาพประจำปี
          ซึ่งผลตรวจสุขภาพประจำปีก็ไม่ได้มีการบอกว่าคนตรวจนั้นเป็นโรคเบาหวานหรือโรคหัวใจหรือไม่
          จึงทำให้ไม่สามารถทราบได้เลยว่าตัวเองนั้นเป็นโรคเบาหวานหรือโรคหัวใจหรือไม่
          ส่วนคนที่ตรวจเจอก็ต้องเป็นการตรวจแบบเฉพาะโรคเท่านั้นซึ่งคนส่วนใหญ่ที่ทำการตรวจเฉพาะโรคนั้น
          ก็คือคนที่มีอาการของโรคแสดงออกมา
          ในขณะที่พฤติกรรมด้านลบที่ทำร้ายตัวเองเกิดจากหลายสิ่งที่เกิดขึ้นซ้ำเดิมในทุกๆวัน
          ทำให้การป้องกันทำได้ล่าช้ากว่าที่ควรจะเป็นซึ่งอาจเป็นผลเสียที่ยากเกินกว่าจะแก้ไขได้อย่างทันท่วงที
        </p>
        <p class="q" style="text-indent: 70px">
          เราจึงมีแนวคิดในการสร้างเว็บไซต์ที่จะเป็นตัวประมวลผลให้กับผู้ใช้งานว่าท่านเป็นโรคเบาหวานหรือโรคหัวใจหรือมีแนวโน้มการเสี่ยงเป็นโรคเบาหวานหรือโรคหัวใจมากน้อยเพียงใด
          เพื่อให้ท่านได้ตระหนักได้ถึงก่อนที่จะสายเกินไปและทำการรักษาหรือเปลี่ยนแปลงพฤติกรรมด้านลบในการใช้ชีวิตประจำวัน
        </p>

        <p class="p">เราให้บริการอะไรท่านบ้าง?</p>
        <p class="q" style="text-indent: 70px">
          นอกจากการตรวจความเสี่ยงการเป็นโรคเบาหวานและโรคหัวใจแล้ว
          เรามีคลังความรู้เกี่ยวกับข้อมูลโรคเบาหวานและข้อมูลโรคหัวใจให้ผู้ใช้ได้อ่านกันเพื่อเป็นแนวทางในการรับมือและป้องกันการเกิดโรค
          และมีมินิเกมส์เล็กๆเพื่อเป็นตัววัดความเข้าใจของผู้ใช้ว่ามีความเข้าใจในโรคเบาหวานและโรคหัวใจมากน้อยเพียงใด
        </p>
        <p class="q" style="text-indent: 70px">
          มากไปกว่านั้นเรายังมีระบบสมัครสมาชิกเพื่อรับสิทธิพิเศษ
          อย่างเช่นประวัติการทำนายเพื่อให้สมาชิกเข้ามาดูการเปลี่ยนแปลงหรือแนวโน้มว่าดีขึ้นหรือแย่ลงมากน้อยเพียงใดโดยการเก็บผลการตรวจในแต่ละครั้ง
        </p>

        <p class="p">เรามีวิธีการตรวจอย่างไร?</p>
        <p class="q" style="text-indent: 70px">
          ในการตรวจเพื่อทำนายโรคเบาหวานหรือโรคหัวใจ
          เราจะให้ท่านกรอกข้อมูลที่ท่านได้จากการตรวจสุขภาพประจำปี
          ซึ่งเราจะนำค่าเหล่านั้นมาเข้าโมเดลทำนาย โดยเรามีการนำความรู้ของ Data
          Mining มาใช้ ซึ่งเราจะทำการเปรียบเทียบโมเดลระหว่าง Decision Tree,
          Random Forest กับ Multi-layer Neuron Network ว่า
          โมเดลไหนมีความแม่นยำมากกว่า และเราจะค่าต่างๆที่ท่านกรอกเข้ามา
          นำมาทดสอบกับโมเดลนี้เพื่อตรวจโรคเบาหวานและโรคหัวใจต่อไป
        </p>

        <p class="p">แล้วจะรู้ได้อย่างไรว่าเรามีความน่าเชื่อถือ?</p>
        <p class="q" style="text-indent: 70px">
          เรามีการนำข้อมูลจาก NHANES ของ Centers for Disease Control and
          Prevention (CDC) ในช่วงปี 2009-2010 ถึงช่วงปี 2017-2018 มาใช้ในการ
          train model
          ซึ่งเป็นข้อมูลประวัติการตรวจของคนเป็นและไม่เป็นโรคเบาหวานและโรคหัวใจจากประเทศสหรัฐอเมริกา
        </p>
      </b-col>
    </b-row>
  </b-container>
</template>

<script>
export default {
  layout: 'headerguest',
  middlewares: ['notAdmin'],
}
</script>

<style>
/* import font Kanit */
@import url('https://fonts.googleapis.com/css2?family=Kanit:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;0,900;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800;1,900&display=swap');
/* import font K2D */
@import url('https://fonts.googleapis.com/css2?family=K2D:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800&display=swap');

.b {
  color: darkslategray;
  font-family: 'K2D', sans-serif;
  font-size: 45px;
  text-align: center;
}

hr.solid {
  border-top: 1px solid #bbb;
}

.p {
  color: black;
  font-family: 'K2D', sans-serif;
  font-size: 25px;
  font-weight: bold;
  margin-top: 50px;
}

.q {
  color: darkslategray;
  font-family: 'K2D', sans-serif;
  font-size: 20px;
}
</style>
