<template>
  <b-container class="mt-5">
    <b-row>
      <b-col cols="12">
        <p class="b">ข้อมูลโรคเบาหวาน</p>
        <hr class="my-4" />
        <p class="p">โรคเบาหวานคืออะไร?</p>
        <p class="q">
          เป็นกลุ่มโรคเกี่ยวกับการเผาผลาญอาหารซึ่งเป็นภาวะที่ร่างกายมีระดับน้ำตาลในเลือดสูงเป็นเวลานาน
          เนื่องจากขาดฮอร์โมนอินซูลิน หรือประสิทธิภาพของอินซูลินลดลง
          ซึ่งมีผลต่อการทำงานของระบบต่างๆในร่างกาย
        </p>

        <b-img src="~assets/55.jpg" fluid center alt="Responsive image" />

        <p class="p">ฮอร์โมนอินซูลินมีความสำคัญต่อร่างกายอย่างไร?</p>
        <p class="q">
          อินซูลินเป็นฮอร์โมนสำคัญตัวหนึ่งของร่างกาย
          เพราะร่างกายคนเรานั้นรับประทานอาหารเข้าไปทุกวัน มีการเปลี่ยนแป้งและ
          โปรตีนให้เป็นน้ำตาล หากไม่มีอินซูลิน
          ก็จะส่งผลให้ร่างกายไม่สามารถนำน้ำตาลไปใช้เป็นพลังงานให้ส่วนต่างๆ
          ของร่างกายได้
          และทำให้มีระดับน้ำตาลในเลือดสูงซึ่งเป็นสาเหตุของการเกิดโรคเบาหวานได้
        </p>

        <p class="p">โรคเบาหวานแบ่งออกเป็น 4 ประเภท</p>
        <ul class="r">
          <li class="s">เบาหวานประเภทที่ 1</li>
          <p class="q">
            ประเภทนี้เกิดจากตับอ่อนไม่สามารถสร้างอินซูลินได้
            จึงต้องฉีดอินซูลินอย่างสม่ำเสมอ
            เพื่อป้องกันไม่ให้เกิดภาวะขาดอินซูลิน
            และไม่ให้ระดับน้ำตาลในเลือดสูงจนเกิดไป เพราะอาจหมดสติ
            และเสียชีวิตได้อย่างเฉียบพลัน
          </p>
          <li class="s">เบาหวานประเภทที่ 2</li>
          <p class="q">
            ประเภทนี้เกิดจากตับอ่อนไม่สามารถสร้างอินซูลินไปใช้ได้อย่างเพียงพอ
            และร่างกายเกิดภาวะดื้ออินซูลิน
            ประเภทนี้มักไม่แสดงอาการอย่างเฉียบพลัน แต่หากขาดการควบคุม
            ก็สามารถนำไปสู่ภาวะแทรกซ้อนเรื้อรังที่เป็นอันตรายอย่างเฉียบพลันได้
          </p>
          <li class="s">เบาหวานประเภทที่ 3</li>
          <p class="q">
            ประเภทนี้เป็นเบาหวานระหว่างตั้งครรภ์
            (เบาหวานวินิจฉัยระหว่างไตรมาสที่ 2 หรือ 3 ของการตั้งครรภ์
            โดยที่ไม่ได้เป็นเบาหวานก่อนหน้า)
          </p>
          <li class="s">เบาหวานประเภทที่ 4</li>
          <p class="q">
            ประเภทนี้เป็นเบาหวานชนิดที่เกิดจากสาเหตุอื่นๆ เช่น
            ความผิดปกติของสารพันธุกรรม จากยา หรือโรคของทางตับอ่อน
          </p>
        </ul>

        <p class="p">สาเหตุของการเกิดโรคเบาหวาน</p>
        <p class="q">
          สาเหตุของโรคเบาหวานมีหลายปัจจัยร่วมกันทั้งปัจจัยทางพันธุกรรมและปัจจัยสิ่งแวดล้อม
        </p>
        <ol class="r">
          <li class="q">กรรมพันธุ์</li>
          <li class="q">
            น้ำหนักเกิน ความอ้วน ขาดการเคลื่อนไหว ขาดการออกกำลังกาย
          </li>
          <li class="q">อายุที่มากขึ้น มีโอกาสเป็นเบาหวานได้มากขึ้น</li>
          <li class="q">
            โรคของตับอ่อน เช่น ตับอ่อนอักเสบ ได้รับการผ่าตัดตับอ่อน
          </li>
          <li class="q">
            การติดเชื้อไวรัสบางชนิด เช่น หัด หัดเยอรมัน คางทูม
            ซึ่งมีผลต่อตับอ่อน
          </li>
          <li class="q">ความเครียดเรื้อรัง</li>
          <li class="q">
            การได้รับยาบางชนิด
            ทำให้มีการสร้างน้ำตาลมากขึ้นหรือการตอบสนองของอินซูลินได้ไม่ดี
          </li>
          <li class="q">
            การตั้งครรภ์ เนื่องจากมีการสร้างฮอร์โมนจากรกหลายชนิด
            ซึ่งมีผลยับยั้งการทำงานของอินซูลิน
          </li>
        </ol>

        <p class="p">ใครบ้างที่เสี่ยงเบาหวาน</p>
        <ul class="r">
          <li class="q">อายุมากกว่า 45 ปีขึ้นไป</li>
          <li class="q">มีประวัติคนในครอบครัวเป็นโรคเบาหวาน</li>
          <li class="q">
            เป็นผู้มีน้ำหนักเกิน หรือมีดัชนีมวลกาย(BMI) ตั้งแต่ 25
            กิโลกรัมต่อตารางเมตร หรือ ตั้งแต่ 23 กิโลกรัมต่อตารางเมตร ในคนเอเชีย
          </li>
          <li class="q">
            ความดันโลหิตสูง (ตั้งแต่ 140/90 มิลลิเมตรปรอทขึ้นไป)
          </li>
          <li class="q">
            สตรีที่มีประวัติเบาหวานขณะตั้งครรภ์หรือน้ำหนักบุตรแรกคลอดมากกว่า 4
            กิโลกรัม
          </li>
          <li class="q">ไม่ออกกำลังกาย</li>
          <li class="q">ดื่มสุรา</li>
          <li class="q">สูบบุหรี่</li>
          <li class="q">สตรีที่มีโรคถุงน้ำในรังไข่</li>
          <li class="q">
            เคยตรวจพบ ระดับน้ำตาลสะสม Hemoglobin A1C (Hb A1C) มากกว่าหรือเท่ากับ
            5.7 % , ภาวะก่อนเป็นเบาหวาน (Impaired fasting glucose)
            คือมีระดับน้ำตาลในกระแสเลือด 100-125 มิลลิกรัมต่อเดซิลิตร
          </li>
          <li class="q">
            ไขมันชนิดชนิดเอชดีแอล (HDL) น้อยกว่า 35 มิลลิกรัมต่อเดซิลิตร หรือ
            ไตรกลีเซอไรด์(TG) มากกว่า 250 มิลลิกรัมต่อเดซิลิตร
          </li>
          <li class="q">
            ผู้ป่วยที่มีประวัติประวัติเป็นโรคหลอดเลือดหัวใจ, หลอดเลือดสมอง
          </li>
        </ul>

        <p class="p">อาการของเบาหวาน</p>
        <ul class="r">
          <li class="q">ปัสสาวะบ่อยทั้งกลางวันและกลางคืน</li>
          <li class="q">กระหายน้ำ</li>
          <li class="q">อ่อนเพลีย และน้ำหนักลด</li>
          <li class="q">หิวบ่อย รับประทานเก่งขึ้น</li>
          <li class="q">คันตามตัว ติดเชื้อได้ง่าย เป็นเชื้อรา ตกขาวบ่อย</li>
          <li class="q">ตาพร่า เห็นภาพไม่ชัด เห็นภาพซ้อน</li>
          <li class="q">ปลายมือ ปลายเท้าชาอันเนื่องมาจากปลายประสาทเสื่อม</li>
        </ul>

        <p class="p">โรคแทรกซ้อนจากโรคเบาหวาน</p>
        <ol class="r">
          <li class="q">
            ตา อาจเป็นต้อกระจกก่อนวัย จอตาเสื่อม ทำให้ตามัวลงเรื่อยๆ
            และอาจทำให้ตาบอดในที่สุด
          </li>
          <li class="q">
            เท้า ทำให้มีอาการชาปลายมือปลายเท้า เกิดแผลได้ง่ายและ
            อาจก่อให้เกิดความพิการ
          </li>
          <li class="q">ไต มักจะเสื่อม จนเกิดภาวะไตเสื่อมเรื้อรัง</li>
          <li class="q">เป็นการติดเชื้อได้ง่ายเนื่องจากภูมิต้านทานต่ำ</li>
          <li class="q">
            ภาวะคีโตซีส(ketosis)ผู้ป่วยมีอาการคลื่นไส้ อาเจียน กระหายน้ำมาก
            หายใจหอบลึก มีไข้ กระวนกระวาย
          </li>
          <li class="q">
            ผนังหลอดเลือดแดงแข็ง ทำให้เป็นความดันโลหิตสูง อัมพาต หัวใจขาดเลือด
            หลอดเลือดสมองตีบ โรคหลอดเลือดแดงส่วนปลาย
          </li>
          <li class="q">เสื่อมสมรรถภาพทางเพศ</li>
        </ol>

        <p class="p">การรักษาโรคเบาหวาน</p>
        <p class="q">
          โรคเบาหวานเป็นโรคเรื้อรัง ซึ่งยังไม่มีทางรักษาให้ขายขาด
          การรักษาจึงเพื่อรักษาระดับน้ำตาลในเลือดให้ใกล้เคียงเกณฑ์ปกติให้มากที่สุด
        </p>
        <ol class="r">
          <li class="q">การรักษาแบบใช้ยา</li>
          <li class="q">การรักษาแบบไม่ใช้ยา</li>
        </ol>

        <p class="p">สิ่งสำคัญที่ผู้ป่วยโรคเบาหวานควรปฏิบัติ</p>
        <ul class="r">
          <li class="q">
            เลือกรับประทานอาหารจำพวกแป้งจากธัญพืชที่ไม่ขัดสี ในปริมาณที่พอเหมาะ
          </li>
          <li class="q">
            พยายามงดอาหารรสจัด ไม่ว่าจะเป็นหวาน มัน หรือเค็ม (โซเดียมน้อยกว่า
            1,500-2,000 มิลลิกรัมต่อวัน)
          </li>
          <li class="q">
            รับประทานผัก และผลไม้ที่ไม่หวานจัดเพื่อเพิ่มกากใยอาหาร
          </li>
          <li class="q">ควบคุมน้ำหนัก</li>
          <li class="q">งดสูบบุหรี่ และงดดื่มสุรา</li>
          <li class="q">
            ออกกำลังกายเป็นประจำในแบบแอโรบิค วันละ 30 นาที 5 ครั้งต่อสัปดาห์
            ตามคำแนะนำของแพทย์ กรณีไม่มีข้อห้าม
          </li>
          <li class="q">
            ระวังอย่ารับประทานยาใด ๆ เองโดยไม่ได้ปรึกษาแพทย์
            โดยเฉพาะยากลุ่มที่เป็นเสตียรอยด์ และยาฮอร์โมน
          </li>
          <li class="q">
            ทำจิตใจให้สงบ และผ่อนคลายความเครียด ไม่โกรธ หรือโมโหง่าย
          </li>
          <li class="q">
            ดูแลและตรวจเท้าทุกวัน เพื่อสำรวจแผลที่ง่ามนิ้วเท้า ฝ่าเท้า
          </li>
          <li class="q">ดูแลสุขภาพฟัน</li>
          <li class="q">ติดตามผลการรักษาอย่างสม่ำเสมอ</li>
          <li class="q">
            รับประทานยาเพื่อควบคุมความดันโลหิต
            หรือเบาหวานตามคำแนะนำของแพทย์อย่างสม่ำเสมอ
          </li>
          <li class="q">
            ผู้ป่วยและผู้ดูแลสังเกตอาการผิดปกติเนื่องจากภาวะน้ำตาลต่ำหรือสูงเกินไป
            เช่น หน้ามืด ใจสั่น หรือหมดสติ
          </li>
        </ul>
        <p class="q"></p>
      </b-col>
    </b-row>
  </b-container>
</template>

<script>
export default {
  layout: 'headerguest',
}
</script>

<style>
/* import font Kanit */
@import url('https://fonts.googleapis.com/css2?family=Kanit:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;0,900;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800;1,900&display=swap');
/* import font K2D */
@import url('https://fonts.googleapis.com/css2?family=K2D:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800&display=swap');

.b {
  color: darkslategray;
  font-family: 'K2D', sans-serif;
  font-size: 45px;
  text-align: center;
}

.p {
  color: black;
  font-family: 'K2D', sans-serif;
  font-size: 30px;
  font-weight: bold;
  margin-top: 50px;
}

.s {
  color: black;
  font-family: 'K2D', sans-serif;
  font-size: 25px;
  font-weight: bold;
}

.q {
  color: darkslategray;
  font-family: 'K2D', sans-serif;
  font-size: 25px;
}

ul.r {
  list-style-position: outside;
}
</style>
